blog/2013-11-09-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 9.11.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="I successfully defended my master thesis this week, so I was too busy to post linkfests in the meantime. But now I am back! I have also released my &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 9.11.2013</h2>
	<div class="entry-content"><p>
I successfully defended my master thesis this week, so I was too busy to post linkfests in the meantime. But now I am back! I have also released my first package on CRAN: <a href="http://cran.r-project.org/web/packages/parboost/">parboost</a>. Expect more on \texttt{parboost} in another post.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://speakerdeck.com/ogrisel/growing-randomized-trees-in-the-cloud">Growing Randomized Trees in the Cloud</a>
</li>
<li><a href="http://cornercases.wordpress.com/2013/10/23/example-python-machine-learning-algorithm-on-spark/">Example Python Machine Learning Algorithm on Spark</a>
</li>
<li><a href="http://gastonsanchez.wordpress.com/2013/10/26/literate-testing-in-r/">Literate Testing in R</a>
</li>
<li><a href="http://weblog.bocoup.com/towards-responsiveness-with-d3/%5D%5BTowards%20Responsiveness%20with%20d3chartjs%20-%20Bocoup%5D%5D">CS281: Advanced Machine Learning</a>
</li>
<li><a href="http://www.sumsar.net/blog/2013/10/how-do-you-write-your-model-definitions/">How Do You Write Your Model Definitions?</a>
</li>
<li><a href="https://www.atlassian.com/git%5D%5BGit%20Tutorials%20and%20Training%20|%20Atlassian%5D%5D">Free Book: Theory and Applications for Advanced Text Mining</a>
</li>
<li><a href="http://adv-r.had.co.nz/memory.html%5D%5BMemory%20usage%20%C2%B7%20Advanced%20R.%5D%5D">Mahout - Future Directions</a>
</li>
<li><a href="https://amplab.cs.berkeley.edu/2013/10/23/got-a-minute-spin-up-a-spark-cluster-on-your-laptop-with-docker/">Got a Minute? Spin up a Spark cluster on your laptop with Docker</a>
</li>
<li><a href="http://intentmedia.github.io/2013/10/30/running-vw-on-emr/">Vowpal Wabbit on Elastic MapReduce</a>
</li>
<li><a href="http://www.drdobbs.com/open-source/machine-learning-with-apache-mahout-the/240163272">Machine Learning with Apache Mahout: The Lay of the Land</a>
</li>
<li><a href="http://accidental-art.tumblr.com/%255D%255Baccidental%2520aRt%255D%255D%5D%5BGraphLab%20Notebook%20|%20GraphLab%5D%5D">GraphLab Notebook | GraphLab</a>
</li>
<li><a href="http://accidental-art.tumblr.com/">accidental aRt</a>
</li>
<li><a href="http://doingbayesiandataanalysis.blogspot.de/2013/10/diagrams-for-hierarchical-models-new.html?m%3D1">Doing Bayesian Data Analysis: Diagrams for hierarchical models: New drawing tools</a>
</li>
<li><a href="http://gigaom.com/2013/11/01/the-gigaom-guide-to-deep-learning-whos-doing-it-and-why-it-matters/">The Gigaom guide to deep learning: Who’s doing it, and why it matters</a>
</li>
<li><a href="http://econsultancy.com/dk/blog/62844-24-beautifully-designed-web-dashboards-that-data-geeks-will-love">24 beautifully-designed web dashboards that data geeks will love</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://jmlr.org/papers/v12/hahsler11a.html">The arules R-Package Ecosystem: Analyzing Interesting Patterns from Large Transaction Data Sets</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper(s) of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://jmlr.org/papers/v11/sonnenburg10a.html">The SHOGUN Machine Learning Toolbox</a>
</li>
<li><a href="http://jmlr.org/papers/v12/tamada11a.html">Parallel Algorithm for Learning Optimal Bayesian Network Structure</a>
</li>
<li><a href="http://jmlr.org/papers/v10/shi09a.html">Hash Kernels for Structured Data</a>
</li>
<li><a href="https://www.atlassian.com/git%255D%255BGit%2520Tutorials%2520and%2520Training%2520|%2520Atlassian%255D%255D%5D%5BFree%20Book:%20Theory%20and%20Applications%20for%20Advanced%20Text%20Mining%5D%5D">Analysis of Random Forest Model</a>
</li>
<li><a href="http://gigaom.com/2013/11/01/the-gigaom-guide-to-deep-learning-whos-doing-it-and-why-it-matters/%5D%5BThe%20Gigaom%20guide%20to%20deep%20learning:%20Who%E2%80%99s%20doing%20it,%20and%20why%20it%20matters%20%E2%80%94%20Tech%20News%20and%20Analysis%5D%5D">Random Search for Hyper-Parameter Optimization</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://strata.oreilly.com/2013/10/julias-role-in-data-science.html">Julia’s Role in Data Science</a>
</li>
<li><a href="http://sensitivecities.com/so-youd-like-to-make-a-map-using-python-EN.html#.Un5sbmRDuzk">So You’d Like To Make a Map Using Python</a>
</li>
<li><a href="http://weblog.bocoup.com/towards-responsiveness-with-d3/">Towards Responsiveness with d3chartjs</a>
</li>
<li><a href="http://gibiansky.github.io/IHaskell/">IHaskell: Haskell for IPython</a>
</li>
<li><a href="http://yannesposito.com/Scratch/en/blog/Haskell-the-Hard-Way/">Learn Haskell Fast and Hard</a>
</li>
<li><a href="http://kkovacs.eu/cassandra-vs-mongodb-vs-couchdb-vs-redis">Cassandra vs MongoDB vs CouchDB vs Redis vs Riak vs HBase vs Couchbase vs Hypertable vs ElasticSearch vs Accumulo vs VoltDB vs Scalaris comparison</a>
</li>
<li><a href="https://github.com/tdsmith/aRrgh">aRrgh: a newcomer’s (angry) guide to data types in R</a>
</li>
<li><a href="https://www.atlassian.com/git">Git Tutorials and Training</a>
</li>
<li><a href="http://adv-r.had.co.nz/memory.html">Memory usage in R</a>
</li>
<li><a href="http://www.ec2instances.info/">Amazon EC2 Instance Comparison</a>
</li>
<li><a href="http://econsultancy.com/dk/blog/62844-24-beautifully-designed-web-dashboards-that-data-geeks-will-love%5D%5B24%20beautifully-designed%20web%20dashboards%20that%20data%20geeks%20will%20love%20|%20Econsultancy%5D%5D">Interview: Bjarne Stroustrup Discusses C++</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-11-09T00:00:00+01:00" pubdate data-updated="true">Nov 9<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>